a13ssandr0/ESP8266_ArtNetNode_v2/src/espArtnetNode_2.0.0_b5g.cpp
      doReboot = true;
    }
    
  // Handle load and save of data
  } else if (json.containsKey("success") && json["success"] == 1 && json.containsKey("page")) {
    if (ajaxSave((uint8_t)json["page"], json)) {
      ajaxLoad((uint8_t)json["page"], jsonReply);

      if (json.size() > 2)
        jsonReply["message"] = "Settings Saved";

    } else {
      jsonReply["success"] = 0;
      jsonReply["message"] = "Failed to save data.  Reload page and try again.";
    }
    
  // Handle reboots
  } else if (json.containsKey("success") && json.containsKey("reboot") && json["reboot"] == 1) {
    jsonReply["success"] = 1;
    jsonReply["message"] = "Device Restarting.";
    
    // Turn pixel strips off if they're on
    pixDriver.updateStrip(0, 0, deviceSettings.portApixConfig);
    pixDriver.updateStrip(1, 0, deviceSettings.portBpixConfig);
    
    doReboot = true;

  // Handle errors
  } 

  jsonReply.printTo(reply);
  webServer.send(200, "application/json", reply);
}

bool ajaxSave(uint8_t page, JsonObject& json) {
  // This is a load request, not a save
  if (json.size() == 2)
    return true;
  
  switch (page) {
    case 1:     // Device Status
      // We don't need to save anything for this.  Go straight to load
      return true;
      break;

    case 2:     // Wifi
      json.get<String>("wifiSSID").toCharArray(deviceSettings.wifiSSID, 40);
      json.get<String>("wifiPass").toCharArray(deviceSettings.wifiPass, 40);
      json.get<String>("hotspotSSID").toCharArray(deviceSettings.hotspotSSID, 20);
      json.get<String>("hotspotPass").toCharArray(deviceSettings.hotspotPass, 20);
      deviceSettings.hotspotDelay = (uint8_t)json["hotspotDelay"];
      deviceSettings.standAloneEnable = (bool)json["standAloneEnable"];

      eepromSave();
      return true;
      break;

    case 3:     // IP Address & Node Name
      deviceSettings.ip = IPAddress(json["ipAddress"][0],json["ipAddress"][1],json["ipAddress"][2],json["ipAddress"][3]);
      deviceSettings.subnet = IPAddress(json["subAddress"][0],json["subAddress"][1],json["subAddress"][2],json["subAddress"][3]);
      deviceSettings.gateway = IPAddress(json["gwAddress"][0],json["gwAddress"][1],json["gwAddress"][2],json["gwAddress"][3]);
      deviceSettings.broadcast = deviceSettings.ip | (~deviceSettings.subnet);
      //deviceSettings.broadcast = {~deviceSettings.subnet[0] | (deviceSettings.ip[0] & deviceSettings.subnet[0]), ~deviceSettings.subnet[1] | (deviceSettings.ip[1] & deviceSettings.subnet[1]), ~deviceSettings.subnet[2] | (deviceSettings.ip[2] & deviceSettings.subnet[2]), ~deviceSettings.subnet[3] | (deviceSettings.ip[3] & deviceSettings.subnet[3])};

      json.get<String>("nodeName").toCharArray(deviceSettings.nodeName, 18);
      json.get<String>("longName").toCharArray(deviceSettings.longName, 64);

      if (!isHotspot && (bool)json["dhcpEnable"] != deviceSettings.dhcpEnable) {
        
        if ((bool)json["dhcpEnable"]) {
          /*
          // Re-enable DHCP
          WiFi.begin(deviceSettings.wifiSSID, deviceSettings.wifiPass);

          // Wait for an IP
          while (WiFi.status() != WL_CONNECTED)
            yield();
          
          // Save settings to struct
          deviceSettings.ip = WiFi.localIP();
          deviceSettings.subnet = WiFi.subnetMask();
          deviceSettings.broadcast = {~deviceSettings.subnet[0] | (deviceSettings.ip[0] & deviceSettings.subnet[0]), ~deviceSettings.subnet[1] | (deviceSettings.ip[1] & deviceSettings.subnet[1]), ~deviceSettings.subnet[2] | (deviceSettings.ip[2] & deviceSettings.subnet[2]), ~deviceSettings.subnet[3] | (deviceSettings.ip[3] & deviceSettings.subnet[3])};
          */
          
          deviceSettings.gateway = INADDR_NONE;
          
        }
        /*
        else {
          // Set static IP
          WiFi.config(deviceSettings.ip,deviceSettings.ip,deviceSettings.ip,deviceSettings.subnet);
        }

        // Add any changes to artnet settings - this will send correct artpollreply
        artRDM.setIP(deviceSettings.ip, deviceSettings.subnet);
        artRDM.setDHCP(deviceSettings.dhcpEnable);
        */

        doReboot = true;
      }

      if (!isHotspot) {
        artRDM.setShortName(deviceSettings.nodeName);
        artRDM.setLongName(deviceSettings.longName);
      }
      
      deviceSettings.dhcpEnable = (bool)json["dhcpEnable"];
      
      eepromSave();
      return true;
      break;

    case 4:     // Port A
      {
        deviceSettings.portAprot = (uint8_t)json["portAprot"];
        bool e131 = (deviceSettings.portAprot == PROT_ARTNET_SACN) ? true : false;
        
        deviceSettings.portAmerge = (uint8_t)json["portAmerge"];
  
        if ((uint8_t)json["portAnet"] < 128)
          deviceSettings.portAnet = (uint8_t)json["portAnet"];
  
        if ((uint8_t)json["portAsub"] < 16)
        deviceSettings.portAsub = (uint8_t)json["portAsub"];
  
        for (uint8_t x = 0; x < 4; x++) {
          if ((uint8_t)json["portAuni"][x] < 16)
            deviceSettings.portAuni[x] = (uint8_t)json["portAuni"][x];
          
          if ((uint16_t)json["portAsACNuni"][x] > 0 && (uint16_t)json["portAsACNuni"][x] < 64000)
            deviceSettings.portAsACNuni[x] = (uint16_t)json["portAsACNuni"][x];

          artRDM.setE131(portA[0], portA[x+1], e131);
          artRDM.setE131Uni(portA[0], portA[x+1], deviceSettings.portAsACNuni[x]);
        }
  
        uint8_t newMode = json["portAmode"];
        uint8_t oldMode = deviceSettings.portAmode;
        bool updatePorts = false;

        #ifndef ONE_PORT
          // RDM and DMX input can't run together
          if (newMode == TYPE_DMX_IN && deviceSettings.portBmode == TYPE_RDM_OUT) {
            deviceSettings.portBmode = TYPE_DMX_OUT;
            dmxB.rdmDisable();
          }
        #endif
        
        if (newMode == TYPE_DMX_IN && json.containsKey("dmxInBroadcast"))
          deviceSettings.dmxInBroadcast = IPAddress(json["dmxInBroadcast"][0],json["dmxInBroadcast"][1],json["dmxInBroadcast"][2],json["dmxInBroadcast"][3]);
         
        
        if (newMode != oldMode) {
  
          // Store the nem mode to settings
          deviceSettings.portAmode = newMode;

