a13ssandr0/ESP8266_ArtNetNode_v2/src/espArtnetNode_2.0.0_b5g.cpp
          doReboot = true;
          /*
          if (oldMode == TYPE_WS2812) {
            doReboot = true;
            
            // Set pixel strip length to zero
            pixDriver.updateStrip(0, 0, deviceSettings.portApixConfig);
  
            // Close ports from pixels - library handles if they dont exist
            for (uint8_t x = 2; x <= 4; x++)
              artRDM.closePort(portA[0], portA[x]);

            // Start our DMX port
            dmxA.begin(DMX_DIR_A, artRDM.getDMX(portA[0], portA[1]));
            
          } else if (oldMode == TYPE_DMX_IN)
            dmxA.dmxIn(false);
          else if (oldMode == TYPE_RDM_OUT)
            dmxA.rdmDisable();

          // Start DMX output with no DMX
          if (newMode == TYPE_DMX_OUT) {
            
            
            artRDM.setPortType(portA[0], portA[1], DMX_OUT);

          // Start DMX output with RDM
          } else if (newMode == TYPE_RDM_OUT) {
            dmxA.rdmEnable(ESTA_MAN, ESTA_DEV);
            dmxA.rdmSetCallBack(rdmReceivedA);
            dmxA.todSetCallBack(sendTodA);
            artRDM.setPortType(portA[0], portA[1], RDM_OUT);

          // Start DMX input
          } else if (newMode == TYPE_DMX_IN) {
            dmxA.dmxIn(true);
            dmxA.setInputCallback(dmxIn);
            
            artRDM.setPortType(portA[0], portA[1], DMX_IN);

          // Start WS2812 output
          } else if (newMode == TYPE_WS2812) {
            doReboot = true;

            dmxA.end();
            
            artRDM.setPortType(portA[0], portA[1], TYPE_DMX_OUT);
            updatePorts = true;
            
            // Initialize the pixel strip
            pixDriver.setStrip(0, DMX_TX_A, deviceSettings.portAnumPix, deviceSettings.portApixConfig);
            
          }
          */
        }
        
        // Update the Artnet class
        artRDM.setNet(portA[0], deviceSettings.portAnet);
        artRDM.setSubNet(portA[0], deviceSettings.portAsub);
        artRDM.setUni(portA[0], portA[1], deviceSettings.portAuni[0]);
        artRDM.setMerge(portA[0], portA[1], deviceSettings.portAmerge);

        // Lengthen or shorten our pixel strip & handle required Artnet ports
        if (newMode == TYPE_WS2812 && !doReboot) {
          // Get the new & old lengths of pixel strip
          uint16_t newLen = (json.containsKey("portAnumPix")) ? (uint16_t)json["portAnumPix"] : deviceSettings.portAnumPix;
          if (newLen > 680)
            newLen = 680;
          
          uint16_t oldLen = deviceSettings.portAnumPix;
          bool lenChanged = false;
  
          // If pixel size has changed
          if (newLen <= 680 && oldLen != newLen) {
            // Update our pixel strip
            deviceSettings.portAnumPix = newLen;
            pixDriver.updateStrip(1, deviceSettings.portAnumPix, deviceSettings.portApixConfig);
  
            lenChanged = true;

            // If the old mode was pixel map then update the Artnet ports
            if (deviceSettings.portApixMode == FX_MODE_PIXEL_MAP)
              updatePorts = true;
          }
            
          // If the old mode was 12 channel FX, update oldLen to represent the number of channels we used
          if (deviceSettings.portApixMode == FX_MODE_12)
            oldLen = 12;
  
          // If our mode changes then update the Artnet ports
          if (deviceSettings.portApixMode != (uint8_t)json["portApixMode"])
            updatePorts = true;
  
          // Store the new pixel mode
          deviceSettings.portApixMode = (uint8_t)json["portApixMode"];
  
          // If our new mode is FX12 then we need 12 channels & store the start address
          if (deviceSettings.portApixMode == FX_MODE_12) {
            if ((uint16_t)json["portApixFXstart"] <= 501 && (uint16_t)json["portApixFXstart"] > 0)
              deviceSettings.portApixFXstart = (uint16_t)json["portApixFXstart"];
            newLen = 12;
          }

          // If needed, open and close Artnet ports
          if (updatePorts) {
            for (uint8_t x = 1, y = 2; x < 4; x++, y++) {
              uint16_t c = (x * 170);
              if (newLen > c)
                portA[y] = artRDM.addPort(portA[0], x, deviceSettings.portAuni[x], TYPE_DMX_OUT, deviceSettings.portAmerge);
              else if (oldLen > c)
                artRDM.closePort(portA[0], portA[y]);
            }
          }
  
          // Set universe and merge settings (port 1 is done above for all port types)
          for (uint8_t x = 1, y = 2; x < 4; x++, y++) {
            if (newLen > (x * 170)) {
              artRDM.setUni(portA[0], portA[y], deviceSettings.portAuni[x]);
              artRDM.setMerge(portA[0], portA[y], deviceSettings.portAmerge);
            }
          }
        }
  
        artRDM.artPollReply();
  
        eepromSave();
        return true;
      }
      break;

    case 5:     // Port B
      #ifndef ONE_PORT
      {
        deviceSettings.portBprot = (uint8_t)json["portBprot"];
        bool e131 = (deviceSettings.portBprot == PROT_ARTNET_SACN) ? true : false;
        
        deviceSettings.portBmerge = (uint8_t)json["portBmerge"];
  
        if ((uint8_t)json["portBnet"] < 128)
          deviceSettings.portBnet = (uint8_t)json["portBnet"];
  
        if ((uint8_t)json["portBsub"] < 16)
        deviceSettings.portBsub = (uint8_t)json["portBsub"];
  
        for (uint8_t x = 0; x < 4; x++) {
          if ((uint8_t)json["portBuni"][x] < 16)
            deviceSettings.portBuni[x] = (uint8_t)json["portBuni"][x];
          
          if ((uint16_t)json["portBsACNuni"][x] > 0 && (uint16_t)json["portBsACNuni"][x] < 64000)
            deviceSettings.portBsACNuni[x] = (uint16_t)json["portBsACNuni"][x];

          artRDM.setE131(portB[0], portB[x+1], e131);
          artRDM.setE131Uni(portB[0], portB[x+1], deviceSettings.portBsACNuni[x]);
        }
  
        uint8_t newMode = json["portBmode"];
        uint8_t oldMode = deviceSettings.portBmode;
        bool updatePorts = false;
        
        // RDM and DMX input can't run together
        if (newMode == TYPE_RDM_OUT && deviceSettings.portAmode == TYPE_DMX_IN)
          newMode = TYPE_DMX_OUT;
        
        if (newMode != oldMode) {
          
          // Store the nem mode to settings
          deviceSettings.portBmode = newMode;

