a13ssandr0/ESP8266_ArtNetNode_v2/src/espArtnetNode_2.0.0_b5g.cpp
          doReboot = true;

          /*
          if (oldMode == TYPE_WS2812) {
            doReboot = true;
            
            // Set pixel strip length to zero
            pixDriver.updateStrip(1, 0, deviceSettings.portBpixConfig);
  
            // Close ports from pixels - library handles if they dont exist
            for (uint8_t x = 2; x <= 4; x++)
              artRDM.closePort(portB[0], portB[x]);

            // Start our DMX port
            dmxB.begin(DMX_DIR_B, artRDM.getDMX(portB[0], portB[1]));
            
            
          } else if (oldMode == TYPE_RDM_OUT)
            dmxB.rdmDisable();
          
          

          // Start DMX output with no DMX
          if (newMode == TYPE_DMX_OUT) {
            artRDM.setPortType(portB[0], portB[1], DMX_OUT);

          // Start DMX output with RDM
          } else if (newMode == TYPE_RDM_OUT) {
            dmxB.rdmEnable(ESTA_MAN, ESTA_DEV);
            dmxB.rdmSetCallBack(rdmReceivedB);
            dmxB.todSetCallBack(sendTodB);
            artRDM.setPortType(portB[0], portB[1], RDM_OUT);

          // Start WS2812 output
          } else if (newMode == TYPE_WS2812) {
            doReboot = true;

            
            //dmxB.end();
            artRDM.setPortType(portB[0], portB[1], TYPE_DMX_OUT);
            updatePorts = true;
            
            // Initialize the pixel strip
            pixDriver.setStrip(1, DMX_TX_B, deviceSettings.portBnumPix, deviceSettings.portBpixConfig);
            
          }
          */
        }
        
        // Update the Artnet class
        artRDM.setNet(portB[0], deviceSettings.portBnet);
        artRDM.setSubNet(portB[0], deviceSettings.portBsub);
        artRDM.setUni(portB[0], portB[1], deviceSettings.portBuni[0]);
        artRDM.setMerge(portB[0], portB[1], deviceSettings.portBmerge);

        // Lengthen or shorten our pixel strip & handle required Artnet ports
        if (newMode == TYPE_WS2812 && !doReboot) {
          // Get the new & old lengths of pixel strip
          uint16_t newLen = (json.containsKey("portBnumPix")) ? (uint16_t)json["portBnumPix"] : deviceSettings.portBnumPix;
          if (newLen > 680)
            newLen = 680;
          
          uint16_t oldLen = deviceSettings.portBnumPix;
          bool lenChanged = false;
  
          // If pixel size has changed
          if (newLen <= 680 && oldLen != newLen) {
            // Update our pixel strip
            deviceSettings.portBnumPix = newLen;
            pixDriver.updateStrip(1, deviceSettings.portBnumPix, deviceSettings.portBpixConfig);
  
            lenChanged = true;

            // If the old mode was pixel map then update the Artnet ports
            if (deviceSettings.portBpixMode == FX_MODE_PIXEL_MAP)
              updatePorts = true;
          }
            
          // If the old mode was 12 channel FX, update oldLen to represent the number of channels we used
          if (deviceSettings.portBpixMode == FX_MODE_12)
            oldLen = 12;
  
          // If our mode changes then update the Artnet ports
          if (deviceSettings.portBpixMode != (uint8_t)json["portBpixMode"])
            updatePorts = true;
  
          // Store the new pixel mode
          deviceSettings.portBpixMode = (uint8_t)json["portBpixMode"];
  
          // If our new mode is FX12 then we need 12 channels & store the start address
          if (deviceSettings.portBpixMode == FX_MODE_12) {
            if ((uint16_t)json["portBpixFXstart"] <= 501 && (uint16_t)json["portBpixFXstart"] > 0)
              deviceSettings.portBpixFXstart = (uint16_t)json["portBpixFXstart"];
            newLen = 12;
          }

          // If needed, open and close Artnet ports
          if (updatePorts) {
            for (uint8_t x = 1, y = 2; x < 4; x++, y++) {
              uint16_t c = (x * 170);
              if (newLen > c)
                portB[y] = artRDM.addPort(portB[0], x, deviceSettings.portBuni[x], TYPE_DMX_OUT, deviceSettings.portBmerge);
              else if (oldLen > c)
                artRDM.closePort(portB[0], portB[y]);
            }
          }
  
          // Set universe and merge settings (port 1 is done above for all port types)
          for (uint8_t x = 1, y = 2; x < 4; x++, y++) {
            if (newLen > (x * 170)) {
              artRDM.setUni(portB[0], portB[y], deviceSettings.portBuni[x]);
              artRDM.setMerge(portB[0], portB[y], deviceSettings.portBmerge);
            }
          }
        }
  
        artRDM.artPollReply();
  
        eepromSave();
        return true;
      }
      #endif
      break;

    case 6:     // Scenes
      // Not yet implemented
      
      return true;
      break;

    case 7:     // Firmware
      // Doesn't come here
      
      break;

    default:
      // Catch errors
      return false;
  }
}

void ajaxLoad(uint8_t page, JsonObject& jsonReply) {

  // Create the needed arrays here - doesn't work within the switch below
  JsonArray& ipAddress = jsonReply.createNestedArray("ipAddress");
  JsonArray& subAddress = jsonReply.createNestedArray("subAddress");
  JsonArray& gwAddress = jsonReply.createNestedArray("gwAddress");
  JsonArray& bcAddress = jsonReply.createNestedArray("bcAddress");
  JsonArray& portAuni = jsonReply.createNestedArray("portAuni");
  JsonArray& portBuni = jsonReply.createNestedArray("portBuni");
  JsonArray& portAsACNuni = jsonReply.createNestedArray("portAsACNuni");
  JsonArray& portBsACNuni = jsonReply.createNestedArray("portBsACNuni");
  JsonArray& dmxInBroadcast = jsonReply.createNestedArray("dmxInBroadcast");

  // Get MAC Address
  char MAC_char[30] = "";
  sprintf(MAC_char, "%02X", MAC_array[0]);
  for (int i = 1; i < 6; ++i)
    sprintf(MAC_char, "%s:%02X", MAC_char, MAC_array[i]);
  
  jsonReply["macAddress"] = String(MAC_char);

  switch (page) {
    case 1:     // Device Status
      jsonReply.remove("ipAddress");
      jsonReply.remove("subAddress");
      jsonReply.remove("gwAddress");
      jsonReply.remove("bcAddress");
      jsonReply.remove("portAuni");
      jsonReply.remove("portBuni");
      jsonReply.remove("portAsACNuni");
      jsonReply.remove("portBsACNuni");
      jsonReply.remove("dmxInBroadcast");
      
